app/controllers/groups_controller.rb

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('ff', '2020-07-16 05:57:31', '2020-07-16 05:57:31')
---
  def create
    @group = Group.new(group_params)
    if @group.save

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def edit
    @group = Group.find(params[:id])

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `name` = 'グループ2', `updated_at` = '2020-07-16 06:27:56' WHERE `groups`.`id` = 1
---
  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)